In [123]:
# importing the required modules
from pathlib import Path
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [124]:
# Housing Path for Files
March_2020csv = Path("./Resources/Housing/March quarter 2020.csv")
March_2021csv = Path("./Resources/Housing/March quarter 2021.csv")
March_2022csv = Path("./Resources/Housing/March quarter 2022.csv")
June_2019csv = Path("./Resources/Housing/June quarter 2019.csv")
June_2020csv = Path("./Resources/Housing/June quarter 2020.csv")
June_2021csv = Path("./Resources/Housing/June quarter 2021.csv")
Sept_2019csv = Path("./Resources/Housing/September quarter 2019.csv")
Sept_2020csv = Path("./Resources/Housing/September quarter 2020.csv")
Sept_2021csv = Path("./Resources/Housing/September quarter 2021.csv")  
Dec_2019csv = Path("./Resources/Housing/December quarter 2019.csv")
Dec_2020csv = Path("./Resources/Housing/December quarter 2020.csv")
Dec_2021csv = Path("./Resources/Housing/December quarter 2021.csv")
Combined_2022csv = Path("./Resources/Housing/2022.csv")
Combined_2023csv = Path("./Resources/Housing/2023.csv")

In [125]:
# pd Reading
March_2020 = pd.read_csv(March_2020csv)
March_2021 = pd.read_csv(March_2021csv)
March_2022 = pd.read_csv(March_2022csv)
June_2019 = pd.read_csv(June_2019csv)
June_2020 = pd.read_csv(June_2020csv)
June_2021 = pd.read_csv(June_2021csv)
Sept_2019 = pd.read_csv(Sept_2019csv)
Sept_2020 = pd.read_csv(Sept_2020csv)
Sept_2021 = pd.read_csv(Sept_2021csv)
Dec_2019 = pd.read_csv(Dec_2019csv)
Dec_2020 = pd.read_csv(Dec_2020csv)
Dec_2021 = pd.read_csv(Dec_2021csv)
Combined_2022 = pd.read_csv(Combined_2022csv)
Combined_2023 = pd.read_csv(Combined_2023csv)

In [126]:
March_2020

                                                   Mean dwelling price, states and territories, March quarter 2020
NaN                                                                                Mean price ($'000)
NSW                                                                                             890.4
VIC                                                                                             754.6
QLD                                                                                             518.7
SA                                                                                              470.1
WA                                                                                              501.9
TAS                                                                                             450.4
NT                                                                                              413.2
ACT                                                                                               701
Australia                                                                                       690.2
Source: Australian Bureau of Statistics, Reside...                                                NaN

In [127]:
#removing Header row
March_2020 = March_2020[1:]

In [128]:
March_2020

                                                   Mean dwelling price, states and territories, March quarter 2020
NSW                                                                                             890.4
VIC                                                                                             754.6
QLD                                                                                             518.7
SA                                                                                              470.1
WA                                                                                              501.9
TAS                                                                                             450.4
NT                                                                                              413.2
ACT                                                                                               701
Australia                                                                                       690.2
Source: Australian Bureau of Statistics, Reside...                                                NaN

In [129]:
#removing all irrelevant rows
March_2020 = March_2020.iloc[8:9]

In [130]:
March_2020

          Mean dwelling price, states and territories, March quarter 2020
Australia                                              690.2

In [131]:
#renaming Column header
March_2020.columns = ['2020 Qtr 1']

In [132]:
#Transposing as Date is a row required within final data
March_2020.transpose()

           Australia
2020 Qtr 1     690.2

In [133]:
#Making Transpose as a new final Dataframe
CleanMarch_2020=March_2020.transpose()
CleanMarch_2020

           Australia
2020 Qtr 1     690.2

In [134]:
#Repeating previous steps for different CSV
March_2021 = March_2021[1:]
March_2021 = March_2021.iloc[8:9]
March_2021.columns = ['2021 Qtr 1']
CleanMarch_2021=March_2021.transpose()
CleanMarch_2021

           Australia
2021 Qtr 1       779

In [135]:
#repeating previous steps for different CSV
March_2022 = March_2022[1:]
March_2022 = March_2022.iloc[8:9]
March_2022.columns = ['2022 Qtr 1']
CleanMarch_2022=March_2022.transpose()
CleanMarch_2022

           Australia
2022 Qtr 1     941.9

In [136]:
CleanMarch_2022

           Australia
2022 Qtr 1     941.9

In [137]:
#repeating previous steps for different CSV
June_2019 = June_2019[1:]
June_2019 = June_2019.iloc[8:9]
June_2019.columns = ['2019 Qtr 2']
CleanJune_2019=June_2019.transpose()
CleanJune_2019

           Australia
2019 Qtr 2     638.9

In [138]:
#repeating previous steps for different CSV
June_2020 = June_2020[1:]
June_2020 = June_2020.iloc[8:9]
June_2020.columns = ['2020 Qtr 2']
CleanJune_2020=June_2020.transpose()
CleanJune_2020

           Australia
2020 Qtr 2     678.5

In [139]:
#repeating previous steps for different CSV
June_2021 = June_2021[1:]
June_2021 = June_2021.iloc[8:9]
June_2021.columns = ['2021 Qtr 2']
CleanJune_2021=June_2021.transpose()
CleanJune_2021

           Australia
2021 Qtr 2     835.7

In [140]:
#repeating previous steps for different CSV
Sept_2019 = Sept_2019[1:]
Sept_2019 = Sept_2019.iloc[8:9]
Sept_2019.columns = ['2019 Qtr 3']
CleanSept_2019=Sept_2019.transpose()
CleanSept_2019

           Australia
2019 Qtr 3     660.8

In [141]:
#repeating previous steps for different CSV
Sept_2020 = Sept_2020[1:]
Sept_2020 = Sept_2020.iloc[8:9]
Sept_2020.columns = ['2020 Qtr 3']
CleanSept_2020=Sept_2020.transpose()
CleanSept_2020

           Australia
2020 Qtr 3     689.5

In [142]:
#repeating previous steps for different CSV
Sept_2021 = Sept_2021[1:]
Sept_2021 = Sept_2021.iloc[8:9]
Sept_2021.columns = ['2021 Qtr 3']
CleanSept_2021=Sept_2021.transpose()
CleanSept_2021

           Australia
2021 Qtr 3     863.7

In [143]:
#repeating previous steps for different CSV
Dec_2019 = Dec_2019[1:]
Dec_2019 = Dec_2019.iloc[8:9]
Dec_2019.columns = ['2019 Qtr 4']
CleanDec_2019=Dec_2019.transpose()
CleanDec_2019

           Australia
2019 Qtr 4       691

In [144]:
#repeating previous steps for different CSV
Dec_2020 = Dec_2020[1:]
Dec_2020 = Dec_2020.iloc[8:9]
Dec_2020.columns = ['2020 Qtr 4']
CleanDec_2020=Dec_2020.transpose()
CleanDec_2020

           Australia
2020 Qtr 4     728.5

In [145]:
#repeating previous steps for different CSV
Dec_2021 = Dec_2021[1:]
Dec_2021 = Dec_2021.iloc[8:9]
Dec_2021.columns = ['2021 Qtr 4']
CleanDec_2021=Dec_2021.transpose()
CleanDec_2021

           Australia
2021 Qtr 4     920.1

In [146]:
Combined_2022

                                                                         Mean dwelling price, states and territories
NaN                                                Jun Qtr 22 Sep Qtr 22                                  Dec Qtr 22
NSW                                                1,270.4    1,176.3                                        1,130.5
VIC                                                973.5      921.6                                            894.4
QLD                                                795.4      767.7                                            738.8
SA                                                 653.1      650.6                                            644.3
WA                                                 643        629.3                                            630.3
TAS                                                685.9      673.6                                            649.6
NT                                                 501.1      490                                              488.2
ACT                                                1,023.7    961.7                                            929.2
Australia                                          961.1      909.9                                            881.2
Source: Australian Bureau of Statistics, Total ... NaN        NaN                                                NaN

In [147]:
#Repeating similar Steps to previous but with Variasion due to different csv structire
Combined_2022 = Combined_2022.reset_index()
Combined_2022 = Combined_2022[1:]
Combined_2022 = Combined_2022.iloc[8:9]
Combined_2022.columns = ['','2022 Qtr 2','2022 Qtr 3','2022 Qtr 4']
Combined_2022 = Combined_2022.iloc[0]
CleanCombined_2022=Combined_2022.transpose()

In [148]:
CleanCombined_2022

              Australia
2022 Qtr 2        961.1
2022 Qtr 3        909.9
2022 Qtr 4        881.2
Name: 9, dtype: object

In [149]:
#As data was an object, creating as DataFrame
data = {
    '': ['2022 Qtr 2', '2022 Qtr 3', '2022 Qtr 4'],
    'Australia': [961.1, 909.9, 881.2]
}

CleanCombined_2022 = pd.DataFrame(data)

In [150]:
CleanCombined_2022

               Australia
0  2022 Qtr 2      961.1
1  2022 Qtr 3      909.9
2  2022 Qtr 4      881.2

In [151]:
Combined_2023

                                                                                         Mean dwelling price, states and territories
NaN                                                Mar Qtr 23 ($'000) Jun Qtr 23 ($'000)                          Sep Qtr 23 ($'000)
NSW                                                1,129.6            1,162.9                                                1,187.2
VIC                                                898.4              894.8                                                    903.6
QLD                                                757.1              773.4                                                    797.9
SA                                                 663.3              694                                                      722.1
WA                                                 653.6              659.3                                                    681.4
TAS                                                670.3              657.8                                                    655.7
NT                                                 517.4              519.4                                                    525.9
ACT                                                940.8              940.2                                                    943.8
Australia                                          890.9              906.2                                                    925.4
Source: Australian Bureau of Statistics, Total ... NaN                NaN                                                        NaN

In [152]:
#Repeating for Combined 2023
Combined_2023 = Combined_2023.reset_index()
Combined_2023 = Combined_2023[1:]
Combined_2023 = Combined_2023.iloc[8:9]
Combined_2023.columns = ['','2023 Qtr 1','2023 Qtr 2','2023 Qtr 3']
Combined_2023 = Combined_2023.iloc[0]
CleanCombined_2023=Combined_2023.transpose()
CleanCombined_2023

              Australia
2023 Qtr 1        890.9
2023 Qtr 2        906.2
2023 Qtr 3        925.4
Name: 9, dtype: object

In [168]:
data = {
    '': ['2023 Qtr 1', '2023 Qtr 2', '2022 Qtr 3'],
    'Australia': [890.9, 906.2, 925.4]
}

CleanCombined_2023 = pd.DataFrame(data)
CleanCombined_2023

               Australia
0  2023 Qtr 1      890.9
1  2023 Qtr 2      906.2
2  2022 Qtr 3      925.4

In [169]:
#Merging of all Single Qtr data
housing_clean = pd.concat([CleanDec_2019, CleanDec_2020, CleanDec_2021, CleanJune_2019,
                            CleanJune_2020, CleanJune_2021, CleanSept_2019, CleanSept_2020, 
                            CleanSept_2021, CleanMarch_2020, CleanMarch_2021, CleanMarch_2022,], sort=False)
housing_clean

           Australia
2019 Qtr 4       691
2020 Qtr 4     728.5
2021 Qtr 4     920.1
2019 Qtr 2     638.9
2020 Qtr 2     678.5
2021 Qtr 2     835.7
2019 Qtr 3     660.8
2020 Qtr 3     689.5
2021 Qtr 3     863.7
2020 Qtr 1     690.2
2021 Qtr 1       779
2022 Qtr 1     941.9

In [170]:
#Adding an Index so I Could merge with the Combined 22, 23 files
housing_clean = housing_clean.reset_index(drop=False)

In [171]:
#Combinding and adding in column headers
Combined = pd.concat([CleanCombined_2022,CleanCombined_2023], sort =False)
Combined.columns=['index','Australia']
Combined

        index  Australia
0  2022 Qtr 2      961.1
1  2022 Qtr 3      909.9
2  2022 Qtr 4      881.2
0  2023 Qtr 1      890.9
1  2023 Qtr 2      906.2
2  2022 Qtr 3      925.4

In [172]:
#Combining all the combined and the Single Qtr data
housing_clean = pd.concat([housing_clean, Combined], sort=False)

In [179]:
#sorting by Value
housing_clean = housing_clean.sort_values('index')
#removing column name for neatness
housing_clean.columns=['','Australia']
housing_clean

               Australia
3   2019 Qtr 2     638.9
6   2019 Qtr 3     660.8
0   2019 Qtr 4       691
9   2020 Qtr 1     690.2
4   2020 Qtr 2     678.5
7   2020 Qtr 3     689.5
1   2020 Qtr 4     728.5
10  2021 Qtr 1       779
5   2021 Qtr 2     835.7
8   2021 Qtr 3     863.7
2   2021 Qtr 4     920.1
11  2022 Qtr 1     941.9
0   2022 Qtr 2     961.1
1   2022 Qtr 3     909.9
2   2022 Qtr 3     925.4
2   2022 Qtr 4     881.2
0   2023 Qtr 1     890.9
1   2023 Qtr 2     906.2

In [180]:
#exporting file
housing_clean.to_csv('housing_clean.csv', index = False)